{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "batch_input_shape": [null, 64, 64, 3], "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "units": 128, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "units": 1, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.4"}