{"backend": "tensorflow", "config": [{"config": {"name": "conv2d_1", "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 64, 64, 3], "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 32, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "filters": 32, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "kernel_constraint": null, "units": 128, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "kernel_constraint": null, "units": 1, "activation": "sigmoid", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.4"}